velioo_webserver/tests/ab_test_application_async10.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      50
Time taken for tests:   163.348 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      26600000 bytes
HTML transferred:       13600000 bytes
Requests per second:    612.19 [#/sec] (mean)
Time per request:       81.674 [ms] (mean)
Time per request:       1.633 [ms] (mean, across all concurrent requests)
Transfer rate:          159.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       4
Processing:    37   81   8.2     79     163
Waiting:       12   40  12.3     39     131
Total:         37   82   8.2     79     164

Percentage of the requests served within a certain time (ms)
  50%     79
  66%     81
  75%     83
  80%     84
  90%     91
  95%     98
  98%    106
  99%    114
 100%    164 (longest request)