velioo_webserver/tests/ab_test_application_async13.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      120
Time taken for tests:   161.100 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      26600000 bytes
HTML transferred:       13600000 bytes
Requests per second:    620.73 [#/sec] (mean)
Time per request:       193.320 [ms] (mean)
Time per request:       1.611 [ms] (mean, across all concurrent requests)
Transfer rate:          161.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0       9
Processing:    93  193  12.9    189     305
Waiting:       25   94  27.0     93     228
Total:         93  193  12.8    190     305
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%    190
  66%    194
  75%    196
  80%    198
  90%    203
  95%    213
  98%    237
  99%    253
 100%    305 (longest request)