velioo_webserver/tests/ab_test_application_async15.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      200
Time taken for tests:   162.113 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      26600000 bytes
HTML transferred:       13600000 bytes
Requests per second:    616.85 [#/sec] (mean)
Time per request:       324.225 [ms] (mean)
Time per request:       1.621 [ms] (mean, across all concurrent requests)
Transfer rate:          160.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2  26.0      1    1022
Processing:   214  322  23.7    318     541
Waiting:       35  172  36.8    168     366
Total:        215  324  35.5    319    1485

Percentage of the requests served within a certain time (ms)
  50%    319
  66%    324
  75%    328
  80%    331
  90%    343
  95%    370
  98%    397
  99%    430
 100%   1485 (longest request)