velioo_webserver/tests/ab_test_application_async21.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   92.037 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      26600000 bytes
HTML transferred:       13600000 bytes
Requests per second:    1086.52 [#/sec] (mean)
Time per request:       92.037 [ms] (mean)
Time per request:       0.920 [ms] (mean, across all concurrent requests)
Transfer rate:          282.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       6
Processing:    38   92   8.7     90     158
Waiting:        5   45   9.0     45     101
Total:         38   92   8.7     90     158

Percentage of the requests served within a certain time (ms)
  50%     90
  66%     93
  75%     95
  80%     98
  90%    104
  95%    109
  98%    115
  99%    120
 100%    158 (longest request)