velioo_webserver/tests/ab_test_application_async25.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   107.384 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      26600000 bytes
HTML transferred:       13600000 bytes
Requests per second:    931.24 [#/sec] (mean)
Time per request:       107.384 [ms] (mean)
Time per request:       1.074 [ms] (mean, across all concurrent requests)
Transfer rate:          241.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       4
Processing:    63  107   5.4    107     151
Waiting:       19   53   8.5     54      97
Total:         63  107   5.4    108     151

Percentage of the requests served within a certain time (ms)
  50%    108
  66%    109
  75%    111
  80%    111
  90%    112
  95%    115
  98%    119
  99%    124
 100%    151 (longest request)