velioo_webserver/tests/ab_test_application_async26.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   104.264 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      26600000 bytes
HTML transferred:       13600000 bytes
Requests per second:    959.11 [#/sec] (mean)
Time per request:       104.264 [ms] (mean)
Time per request:       1.043 [ms] (mean, across all concurrent requests)
Transfer rate:          249.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       5
Processing:    54  104   5.5    104     156
Waiting:       10   56   9.5     56      86
Total:         54  104   5.4    104     156

Percentage of the requests served within a certain time (ms)
  50%    104
  66%    106
  75%    107
  80%    108
  90%    110
  95%    112
  98%    116
  99%    121
 100%    156 (longest request)