velioo_webserver/tests/ab_test_application_async30.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   119.501 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      26600000 bytes
HTML transferred:       13600000 bytes
Requests per second:    836.81 [#/sec] (mean)
Time per request:       119.501 [ms] (mean)
Time per request:       1.195 [ms] (mean, across all concurrent requests)
Transfer rate:          217.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       6
Processing:    46  119   7.1    119     173
Waiting:       21   59   7.7     58     103
Total:         47  119   7.0    119     173

Percentage of the requests served within a certain time (ms)
  50%    119
  66%    121
  75%    122
  80%    123
  90%    127
  95%    132
  98%    138
  99%    141
 100%    173 (longest request)