velioo_webserver/tests/ab_test_application_async37.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      150
Time taken for tests:   87.981 seconds
Complete requests:      100000
Failed requests:        0
Keep-Alive requests:    100000
Total transferred:      32400000 bytes
HTML transferred:       13600000 bytes
Requests per second:    1136.60 [#/sec] (mean)
Time per request:       131.972 [ms] (mean)
Time per request:       0.880 [ms] (mean, across all concurrent requests)
Transfer rate:          359.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       7
Processing:    92  132   5.8    132     224
Waiting:       31   69  10.0     68     151
Total:         92  132   5.8    132     224

Percentage of the requests served within a certain time (ms)
  50%    132
  66%    134
  75%    135
  80%    135
  90%    138
  95%    140
  98%    143
  99%    147
 100%    224 (longest request)