velioo_webserver/tests/ab_test_application_async4.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   164.561 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      26600000 bytes
HTML transferred:       13600000 bytes
Requests per second:    607.68 [#/sec] (mean)
Time per request:       164.561 [ms] (mean)
Time per request:       1.646 [ms] (mean, across all concurrent requests)
Transfer rate:          157.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.8      1      14
Processing:    72  164  16.1    159     289
Waiting:       16   79  25.5     77     214
Total:         73  165  16.1    160     289

Percentage of the requests served within a certain time (ms)
  50%    160
  66%    164
  75%    168
  80%    172
  90%    185
  95%    199
  98%    213
  99%    224
 100%    289 (longest request)